OdDAI.AggregationType.elementType
\details
Retrieves data type contained in the aggregation type.
\returns Returns a smart pointer to the data type.

OdDAI.AggregationType.type(OdSharedPtr&lt;OdTypeCode&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a type code for aggregation type.
\param typeCode [in] A type code for aggregation type.

OdDAI.AggregationType.type
\details
Retreives a type code of aggregation type.
\returns Returns a smart pointer to type code of aggregation type.

OdDAI.AggregationType.#ctor(OdSmartPtr&lt;OdDAI.BaseType&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new aggregation type definition with specified parameters.
\param elementType [in] A smart pointer to a data type contained in the aggregation type.